class AppStrings {
  static const String emailRegExp =
      r'^([^\x00-\x20\x22\x28\x29\x2c\x2e\x3a-\x3c\x3e\x40\x5b-\x5d\x7f-\xff]+|\x22([^\x0d\x22\x5c\x80-\xff]|\x5c[\x00-\x7f])*\x22)(\x2e([^\x00-\x20\x22\x28\x29\x2c\x2e\x3a-\x3c\x3e\x40\x5b-\x5d\x7f-\xff]+|\x22([^\x0d\x22\x5c\x80-\xff]|\x5c[\x00-\x7f])*\x22))*\x40([^\x00-\x20\x22\x28\x29\x2c\x2e\x3a-\x3c\x3e\x40\x5b-\x5d\x7f-\xff]+|\x5b([^\x0d\x5b-\x5d\x80-\xff]|\x5c[\x00-\x7f])*\x5d)(\x2e([^\x00-\x20\x22\x28\x29\x2c\x2e\x3a-\x3c\x3e\x40\x5b-\x5d\x7f-\xff]+|\x5b([^\x0d\x5b-\x5d\x80-\xff]|\x5c[\x00-\x7f])*\x5d))*$';
  static const String baseUrl = 'http://localhost:8080/api';
  static const String timeMachineDescription =
      'Инициирую протокол временно́го перемещения... '
      'Сканирование архивных данных... '
      'Обнаружен доступ к модулю "Хронохранилище Neoflex"...\n'
      'Приветствую тебя в блоке "Машина времени". '
      'Данный сегмент содержит цифровые отпечатки ключевых событий Neoflex. '
      'Оптимальный метод интеграции в компанию – изучение ее истории. '
      'Поэтому, юнит, приготовься к прыжку сквозь эпохи!\n'
      'Внимание! Системное предупреждение: Обнаружена ошибка целостности… '
      'Для активации полного доступа требуется восстановление недостающей информации…\n'
      'Кажется, у нас проблемы, вместо четкой хроники перед нами цифровая головоломка '
      'с заполнением пропусков. Я выделил 3 временные эпохи, в каждой – принадлежащие '
      'ей ключевые события, но некоторые варианты... скажем так, альтернативные. '
      'Помоги собрать пазл, чтобы понять, как мы стали теми, кто мы есть.\n'
      'Рекомендация: для успешного прохождения испытания необходимо выбрать среди '
      'предоставленных вариантов правдивые факты, подсказки можно найти в соцсетях компании.\n'
      'Ограничение: у вас есть 3 попытки на прохождение каждого теста.\n'
      'Ожидание действий юнита для начала калибровки временных точек…';
}
